{"data":{"site":{"siteMetadata":{"title":"JR static page","author":"JG"}},"markdownRemark":{"id":"897f6e31-ee72-59db-b58b-281a757c23be","excerpt":"","html":"<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\"> &lt;div id=&quot;container&quot; class=&quot;new-design-cont clearfix&quot;&gt;\n                    &lt;div class=&quot;static-banner-hlder&quot; style=&quot;background:#450e07 !important;&quot;&gt;\n                        &lt;img src=&quot;./wiki_files/Rummy-Wiki.jpg&quot; border=&quot;0&quot; alt=&quot;Rummy wiki&quot;&gt;\n                    &lt;/div&gt;\n                    &lt;div class=&quot;breadcrumb-bar&quot;&gt;\n                        &lt;div class=&quot;breadcrumb-bar-sub&quot; id=&quot;breadcrumbBar&quot;&gt;\n\n                        &lt;/div&gt;\n                    &lt;/div&gt;\n                    &lt;div class=&quot;wrapper&quot;&gt;\n                        &lt;div class=&quot;page-text clearfix&quot;&gt;\n                            &lt;h1 class=&quot;static-page-heading&quot;&gt;Rummy Wiki – The Glossary of Rummy Terms&lt;/h1&gt;\n                            &lt;br&gt;\n                            &lt;div class=&quot;mobile-rummy-cont cont-section&quot;&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;Having difficulty in understanding some rummy terms? Don’t worry. &lt;a class=&quot;vglnk&quot; href=&quot;http://jungleerummy.com/&quot; rel=&quot;nofollow&quot;&gt;&lt;span&gt;JungleeRummy&lt;/span&gt;&lt;span&gt;.&lt;/span&gt;&lt;span&gt;com&lt;/span&gt;&lt;/a&gt; provides you with a comprehensive glossary covering all types of games, concepts, &lt;a href=&quot;https://www.jungleerummy.com/how-to-play-rummy&quot;&gt;rules and gameplay!&lt;/a&gt; We have put together for you an exhaustive list of all the commonly used terms in Indian rummy games.&lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;&lt;b&gt;101 Pool Rummy:&lt;/b&gt; This variation of rummy has the element of elimination in every deal. The game goes on for a number of deals until all the players except one are eliminated because of having reached 101 points. The losing players get points equal to the total value of their unmatched or unarranged cards at the end of each deal. When a player’s score reaches 101 points, he/she is eliminated from the game and the player who survives till the end is declared the winner.&lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;&lt;b&gt;201 Pool Rummy:&lt;/b&gt; The game of 201 Pool Rummy is the same as the game of 101 Pool Rummy except that the players are eliminated when they reach 201 points. The player who makes it till the end without accumulating 201 points wins the game.&lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;&lt;b&gt;Aces:&lt;/b&gt; A standard deck of 52 cards used in rummy contains 4 Aces. They come in the different suits of Clubs, Diamonds, Hearts and Spades. Aces can be used to form a lower-value sequence like Ace 2, 3, or they can be used to form a sequence with high cards, for example Ace, King and Queen. The points carried by each ace are 10. If a printed Joker is selected as the wild Joker, then Aces also function as wild Jokers, along with the printed Joker.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Best of Three:&lt;/b&gt; It is a form of Deals Rummy where players play for three rounds. The player who has won the highest number of chips, from the opponents, at the end of the three deals is declared the winner.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Buy-In:&lt;/b&gt; It refers to the cash amount that one pays to enter a cash rummy tournament. This is also referred to, more commonly, as ‘entry fee,’ which the player puts at stake. The accumulative buy-in forms the prize pool, which is won by the top-performing players of the tournament.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Closed Deck: &lt;/b&gt; It refers to a deck of face-down cards that are left after cards forming a complete hand have been dealt to each player. Players can pick cards (one on each turn) from the closed deck during their turns. The closed deck is reshuffled when all the cards have been picked by the players.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Dealing:&lt;/b&gt; It refers to the distribution of cards to each player by the dealer at the start of each hand a round of play). The dealing takes place after a toss is made to choose the dealer.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Dealer:&lt;/b&gt; The player who deals cards at the start of a hand is called the dealer. In offline games, the players themselves decide on who should be the dealer of the game or make a toss to decide that.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Deck:&lt;/b&gt; It refers to a pack of cards. A regular rummy deck has 52 cards. In &lt;a href=&quot;https://www.jungleerummy.com/13-cards-rummy&quot;&gt;13-card rummy&lt;/a&gt;, two regular decks of cards including two printed Jokers.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Declare:&lt;/b&gt; When a player completes the objective of a 13-card rummy game, he/she finishes the game by discarding a card to the finish slot and declaring the cards in his/her hand to the opponents.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Draw:&lt;/b&gt; On a player’s turn, he/she has to pick a card from the closed or open deck. This process is called drawing a card.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Discard: &lt;/b&gt; On a player’s turn, he/she has to draw a card from the closed or dpen deck and then put a card facing up on the open deck. This process of putting a card on the open deck is called discarding a card.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Drop: &lt;/b&gt; A player has the option to quit or leave the game before it concludes, which is called dropping. In &lt;a href=&quot;https://www.jungleerummy.com/&quot;&gt;online rummy&lt;/a&gt;, players can drop a game on their turn by clicking on the “Drop” button.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Face Card: &lt;/b&gt; All Kings, Queens, Aces and Jacks of all the suits are called face cards.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Hand:&lt;/b&gt; The cards that are dealt to a player at the beginning of a game are called a hand. Each player has to arrange the cards in his/her hand in sequences and/or sets.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Impure Sequence: &lt;/b&gt;\n                                    &lt;br&gt; A group of three or more consecutive cards of the same suit formed with a Joker is called an impure sequence.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Pure Sequence:&lt;/b&gt; A group of three or more consecutive cards of the same suit formed without a Joker is called as pure sequence.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    &lt;b&gt;Set:&lt;/b&gt; A group of three or four cards of the same rank but of different suits is called a set.\n                                &lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;&lt;b&gt;Unmatched Cards:&lt;/b&gt; The cards that a losing players has failed to arrange in sets or sequences by the end of a game are called unmatched cards.&lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;&lt;b&gt;Wild Joker:&lt;/b&gt; The card that which is selected as the Joker after the dealer has dealt cards is called the wild Joker. It can replace any card to form a sequence or set.&lt;/p&gt;\n\n                                &lt;p style=&quot;padding-bottom:0 !important;&quot;&gt;\n                                    We hope that the our Rummy Wiki helped you understand all the technical terms used in rummy. If you have any queries regarding any terms used in the rummy wiki, please mail us at &lt;a href=&quot;mailto:support@jungleerummy.com&quot;&gt;support@jungleerummy.com&lt;/a&gt; and we will be happy to help you.\n                                &lt;/p&gt;\n\n                                &lt;div class=&quot;clearit&quot;&gt;&lt;/div&gt;\n\n                            &lt;/div&gt;\n\n                        &lt;/div&gt;\n\n                      &lt;/div&gt;\n                &lt;/div&gt;</code></pre></div>","frontmatter":{"title":"Page 3","date":"May 28, 2015","description":"This is a custom description for SEO and Open Graph purposes, rather than the default generated excerpt. Simply add a description field to the frontmatter."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/page-3/"}}