{"data":{"site":{"siteMetadata":{"title":"JR static page","author":"JG"}},"markdownRemark":{"id":"897f6e31-ee72-59db-b58b-281a757c23be","excerpt":"Rummy wikiRummy Wiki – The Glossary of Rummy TermsHaving difficulty in understanding some rummy terms? Don’t worry.\nJungleeRummy.com\nprovides you with a…","html":"<div id=\"container\" class=\"new-design-cont clearfix\">\n<div class=\"static-banner-hlder\" style=\"background:#450e07 !important;\">\n<p><img src=\"./wiki_files/Rummy-Wiki.jpg\" alt=\"Rummy wiki\"></p>\n</div>\n<div class=\"breadcrumb-bar\">\n<div id=\"breadcrumbBar\" class=\"breadcrumb-bar-sub\">\n</div>\n</div>\n<div class=\"wrapper\">\n<div class=\"page-text clearfix\">\n<h1>Rummy Wiki – The Glossary of Rummy Terms</h1>\n<div class=\"mobile-rummy-cont cont-section\">\n<p>Having difficulty in understanding some rummy terms? Don’t worry.\n<a href=\"http://jungleerummy.com/\"><span>JungleeRummy</span><span>.</span><span>com</span></a>\nprovides you with a comprehensive glossary covering all types of games,\nconcepts, <a href=\"https://www.jungleerummy.com/how-to-play-rummy\">rules and\ngameplay!</a> We have put\ntogether for you an exhaustive list of all the commonly used terms in\nIndian rummy games.</p>\n<p><strong>101 Pool Rummy:</strong> This variation of rummy has the element of\nelimination in every deal. The game goes on for a number of deals until\nall the players except one are eliminated because of having reached 101\npoints. The losing players get points equal to the total value of their\nunmatched or unarranged cards at the end of each deal. When a player’s\nscore reaches 101 points, he/she is eliminated from the game and the\nplayer who survives till the end is declared the winner.</p>\n<p><strong>201 Pool Rummy:</strong> The game of 201 Pool Rummy is the same as the game\nof 101 Pool Rummy except that the players are eliminated when they reach\n201 points. The player who makes it till the end without accumulating\n201 points wins the game.</p>\n<p><strong>Aces:</strong> A standard deck of 52 cards used in rummy contains 4 Aces.\nThey come in the different suits of Clubs, Diamonds, Hearts and Spades.\nAces can be used to form a lower-value sequence like Ace 2, 3, or they\ncan be used to form a sequence with high cards, for example Ace, King\nand Queen. The points carried by each ace are 10. If a printed Joker is\nselected as the wild Joker, then Aces also function as wild Jokers,\nalong with the printed Joker.</p>\n<p><strong>Best of Three:</strong> It is a form of Deals Rummy where players play for\nthree</p>\n</div>\n</div>\n</div>\n</div>","frontmatter":{"title":"Page 3","date":"May 28, 2015","description":"This is a custom description for SEO and Open Graph purposes, rather than the default generated excerpt. Simply add a description field to the frontmatter."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/page-3/"}}